In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {'one': [10, np.nan, 30],
        'two': [np.nan, np.nan, 50],
        'three': [10, 10, 10]}

In [4]:
df = pd.DataFrame(dict)

In [5]:
df

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  50.0     10

In [6]:
df.dropna()

    one   two  three
2  30.0  50.0     10

In [7]:
df.dropna(axis=1)

   three
0     10
1     10
2     10

In [8]:
df.dropna(thresh=2)

    one   two  three
0  10.0   NaN     10
2  30.0  50.0     10

In [9]:
df.fillna(value='Something')

         one        two  three
0         10  Something     10
1  Something  Something     10
2         30         50     10

In [11]:
df['one'].fillna(value=df['one'].mean())

0    10.0
1    20.0
2    30.0
Name: one, dtype: float64